#  чтобы программа не закрывалась
while True:
    user_input = input("Введите число N (от 2 до 50000): ")

    # Проверяем
    if len(user_input) == 0 or not user_input.isdigit():
        print("Дружок, ты знаешь как выглядят числа ? Давай еще раз ;)")
        continue  # запросить ввод снова

    #  строку в число
    n = int(user_input)

    # Простые числа начинаются с 2
    if n < 2:
        print("Зайка, повнимательнее ! Сделаем вид, что этого не было и начнем заново")
        continue

    #  от зависания
    if n > 50000:
        print("Что непонятного в формулировке ВВЕСТИ ЧИСЛО ОТ 2 ДО 50000? Еще раз вводи")
        continue

    #  прерываем цикл запроса ввода
    break

# пишем словарь, ключи — числа, а значения — флаг True (изначально все числа считаются простыми)
sieve = dict()
for i in range(2, n + 1):
    sieve[i] = True

#  вычеркиваем составные числа
for i in range(2, int(n**0.5) + 1):
    # Если число еще не вычеркнуто
    if sieve[i]:
        # Вычеркиваем все кратные ему числа (i*i, i*i + i, и т.д.)
        for j in range(i * i, n + 1, i):
            sieve[j] = False

# Выводим каждое простое число в отдельной строке
for number, is_prime in sieve.items():
    if is_prime:
        print(number)

